#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.main: Refreshing state... [id=546c96e928edef00a52fcf76331f06052674f543]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNTFhZGExZS0wZmE5LTQ1NjYtOGE5Mi02ZTdhNDRmODM1ZjQ7b2JqZWN0SWQ9MjZlOTc1YjItZGUwMi00NzkyLTg1MTItZjZiYjQzNmY2MzFiO3N1YnNjcmlwdGlvbklkPTYxMWI3YjkyLTMyMzItNDEyNS05NmUyLTQxYjJmNDViYjMzZTt0ZW5hbnRJZD1jYzRjMjdkZi02YjgyLTQ4MmEtOGU3MS01ZmZhYWUxZjg0YWM=]
data.azurerm_resource_group.example: Reading...
data.azurerm_resource_group.example: Read complete after 5s [id=/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/611b7b92-3232-4125-96e2-41b2f45bb33e/resourceGroups/anis-20230105-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-1" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "18096ffe-0ce5-44f5-bd69-892a58018d80" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_9718f7d49ba74071bc50bcdf8b473398" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @MohdmM01, Action: `pull_request`*